In [1]:
import pandas as pd

In [3]:
# Q1. Create a Pandas Series that contains the following data: 
# 4, 8, 15, 16, 23, and 42. Then, print the series.


numSeries = pd.Series([4, 8, 15, 16, 23, 42])
print(numSeries)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series 
# function on the variable print it.
v = [1,2,3,4,5,6,7,8,9,10]
var = pd.Series(v)
print(var)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [6]:
# Q3. Create a Pandas DataFrame that contains the following data:
d = {"Name":["Alice","Bob","Claire"], "Age":[25,30,27],"Gender":["Female","Male","Female"]}
df = pd.DataFrame(d)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
# Q4. What is ‘DataFrame’ in pandas and how is it different 
# from pandas.series? Explain with an example.
Dataframe is two dimensional array like structure in pandas.It consists of rows and columns.
Series is one dimensional array. One column in a dataframe can be considered as a series.

Considering above example of dataframe , the column Name is a series. Dataframe consists of 
multiple series.

In [7]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [8]:
# Selection
df.iloc[1,2]

'Male'

In [9]:
df.loc[0,"Age"]

25

In [11]:
df.head(1)  #first row in df

    Name  Age  Gender
0  Alice   25  Female

In [12]:
df.tail(1)  #last 1 row in df

     Name  Age  Gender
2  Claire   27  Female

In [13]:
df.describe()  #describes attributes of int column

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [14]:
df.columns  #list of column name

Index(['Name', 'Age', 'Gender'], dtype='object')

In [15]:
df["Name"]  #series of one column

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [16]:
df[["Name","Age"]]  #selecting 2 columns

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

In [ ]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Dataframe and Panel are mutable. Their elements can be selected and changed as per need.
For series, its size cannot be changed but values can be.

In [22]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.
ser1 = pd.Series(["Pune","Banglore","Chennai","Surat"], name= "City")
ser2 = pd.Series([1,2,3,4,5],name = "Count")
ser3 = pd.Series([True,False,True,True,True],name="BoolData")
#created 3 series with different datatypes

In [23]:
df1 = pd.concat([ser1,ser2,ser3],axis=1)
# concat function is used to combine 2 or more series into dataframe

In [24]:
df1
# printing dataframe

       City  Count  BoolData
0      Pune      1      True
1  Banglore      2     False
2   Chennai      3      True
3     Surat      4      True
4       NaN      5      True